Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In Alice’s game example, the streaming application could operate with two different notions of time, Processing time or Event time.
zh_cn: 在爱丽丝游戏的例子中，流式应用可以使用两个不同概念的时间，即处理时间和事件时间。

source: In Alice’s game example, the streaming application could operate with two different notions of time: processing time or event time.
zh_cn: 在爱丽丝游戏的例子中，流式应用可以使用两个不同概念的时间，即处理时间（processing time）和事件时间（event time）。

source: In Chapter 1, you learned that streaming applications have different operational requirements than traditional batch programs.
zh_cn: 在第一章，你已经了解到流式应用和传统批处理程序在操作的需求上有所差异，

source: In Chapter 2 we pointed out that most streaming applications are stateful.
zh_cn: 在第2章我们指出，大部分的流式应用都是状态化的。

source: In Chapter 6, things are going to get even more interesting—we will learn how to enrich our programs with window operators and time semantics.
zh_cn: 在第6章，我们将会接触到一些更加有意义的内容——学习如何利用窗口算子和时间语义来进一步丰富我们的程序。

source: In Example 10-2 two chained tasks are created: one task for Filter1 and Map1 and another task for Map2 and Filter2.
zh_cn: 示例10-2中会创建两个链接任务：一个由Filter1和Map1组成，另一个由Map2和Filter2组成。

source: In Example 8-15, this is a Tuple2 with a
zh_cn: 示例8-15中用到的是一个由String和Double字段组成的Tuple2。

source: In Example 8-15, this is a string holding the name of
zh_cn: 在示例8-15中，标识符是一个字符串类型的事务文件名。

source: In Example 8-15, we check if the transaction file still exists and move it to the target directory if that is the case.
zh_cn: 示例8-15中，我们会检查事务文件是否存在，如果存在则将它移动到目标目录。

source: In Example 8-16, we show how to apply
zh_cn: 示例8-16中，我们展示了如何在DataStream上应用AsyncFunction。

source: In Example 8-4, we use a Sim pleStringEncoder, which calls the toString() method of the record and writes the String representation of the record to the file.
zh_cn: 该示例中用到了一个SimpleStringEncoder，它会调用记录的toString()方法，从而让我们可以将记录以String形式写入文件中。

source: In Example 8-5 we use a Parquet writer for Avro files.
zh_cn: 在示例8-5中，我们选用了Avro类型的Parquet写入器。

source: In Figure 2-2, the output of the “Extract hashtags” operator is partitioned by the key (the hashtag), so that the count operator tasks can correctly compute the occurrences of each hashtag.
zh_cn: 图2-2中，"Extract hashtags"算子的输出就是按照键值（主题标签）划分的，因此下游的计数算子可以正确计算出每个主题标签的出现次数。

source: In Figure 3-17, Flink took a checkpoint when the input offset was 5, and the sums were 6 and 9.
zh_cn: 在图3-17中，Flink会在输入偏移到达5的时候生成一个检查点，此时两个和值分别为6和9。

source: In Flink 1.7, changing the data type of a state is supported if the data type was defined as an Apache Avro type and if the new data type is also an Avro type that was evolved from the original type according to Avro’s schema evolution rules.
zh_cn: 在Flink 1.7版本，如果数据类型为Apache Avro类型，并且新的数据类型也是一个遵循Avro的Schema演变规则、从原类型演变而来的Avro类型，那么此时就可以支持改变状态数据类型。

source: In Flink, any keyed state can be exposed to exter‐ nal applications as queryable state and act as a read-only key-value store.
zh_cn: 在Flink中，任何键值分区状态都可以作为可查询式状态暴露给外部应用，就像一个只读的键值存储一样。

source: In Flink, keys are not predefined in the input types like in systems that work with key-value pairs.
zh_cn: 和某些使用键值对的系统不同，Flink不是在输入类型中提前定义好键值，

source: In Flink, state is always associated with a specific operator.
zh_cn: 在Flink中，状态都是和特定算子相关联。

source: In Flink, such a state is called a broadcast state.
zh_cn: 在Flink中，这种状态称为广播状态（broadcast state），

source: In Flink, watermarks are implemented as special records holding a timestamp as a Long value.
zh_cn: 在Flink中，水位线是利用一些包含Long值时间戳的特殊记录来实现的。

source: In Flink, watermarks are implemented as special records holding a timestamp long value.
zh_cn: 在Flink中，水位线是利用一些包含时间戳long值的特殊记录来实现的。

source: In Flink’s DataStream API, any operator or function can send data to an external sys‐ tem or application.
zh_cn: Flink DataStream API中的任何算子或函数都可以向外部系统或应用发送数据。

source: In Flink’s design it is the responsibility of the state backend to perform a checkpoint.
zh_cn: 按照Flink的设计，是由状态后端负责生成检查点，

source: In PRO CESS_CONTINUOUSLY, the path is periodically scanned (after an initial scan) and
zh_cn: 而在PROCESS_CONTINUOUSLY模式下，数据源会（在首次扫描后）对路径进行周期性扫描，所有新添加的或是修改过的文件都会被持续读入。

source: In PROCESS_CONTINUOUSLY mode, the filesystem source connector identifies new files based on their modification timestamp.
zh_cn: 在PROCESS_CONTINUOUSLY模式下，文件系统数据源连接器会根据文件的修改时间来识别新文件。

source: In PROCESS_ONCE mode, the read path is scanned once when the job is started and all matching files are read.
zh_cn: 在PROCESS_ONCE模式下，目标路径只会在作业启动被扫描一次，随后数据源就会读取所有满足条件的文件；

source: In a batch processing scenario, all these questions are answered because a batch job can be simply restarted from the beginning.
zh_cn: 在批处理场景下，上面提到的都不算问题。由于批处理任务可以轻易"从头再来"，

source: In a batch processing scenario, you can solve all these problems easily since all the input data is available.
zh_cn: 在批处理场景下，由于可以得到所有输入数据，上述问题都能轻松解决。

source: In a nutshell, Kafka’s transactions work by appending all messages to the log of a partition and marking messages of open transactions as uncommitted.
zh_cn: 简而言之，Kafka的事务的实现原理是把全部消息都追加到分区日志中，并将未完成事务的消息标记为未提交。

source: In a real-word streaming architecture however, it is common to have several connected components.
zh_cn: 但在现实世界的流处理架构中，有多个连接组件是很稀松平常的事儿。

source: In a real-world streaming application however, there will be at least one source and one sink apart from the stream processor.
zh_cn: 在实际流处理应用中，除了流处理引擎也至少还要有一个数据来源组件和一个数据终点组件。

source: In a standalone deployment, the master and workers are not automatically restarted in the case of a failure.
zh_cn: 在独立集群部署模式下，主进程和工作进程不会因为故障而重启。

source: In a true streaming model, events can be processed as soon as they arrive in the system and latency more closely reflects the actual work that has to performed on each event.
zh_cn: 在该模型中，事件一到达系统就可以进行处理，延迟会更真实地反映出每个事件都要经历的实际执行工作。

source: In a true stream‐ ing model, events can be processed as soon as they arrive in the system and latency more closely reflects the actual work that has to be performed on each event.
zh_cn: 在真正的流模型中，事件一到达系统就可以进行处理，延迟会更加真实地反映出每个事件都要经历的实际处理工作。

source: In addition to configuring the Hadoop dependencies, you need to provide the loca‐ tion of Hadoop’s configuration directory.
zh_cn: 除了配置Hadoop依赖，你还需要提供Hadoop配置目录的位置。

source: In addition to disabling chaining for the whole application, you can also control the chaining behavior of individual operators.
zh_cn: 除了对整个应用禁用任务链接，你还可以控制单个算子的链接行为。

source: In addition to joining two streams, it is also possible to cogroup two streams on a window by starting the operator definition with coGroup() instead of join().
zh_cn: 除了对窗口中的两条流进行Join，还可以对它们进行Cogroup。只需将算子定义开始位置的join()改为coGroup()即可。

source: In addition to keeping state around, the downstream operators or external systems that follow an operator, which updates previously emitted results, need to be able to handle these updates.
zh_cn: 除了在算子中保持状态，受结果更新影响下游算子或外部系统还得能够处理这些更新。

source: In addition to record timestamps, a Flink event-time application must also provide watermarks.
zh_cn: 除了记录的时间戳，Flink基于事件时间的应用还必须提供水位线。

source: In addition to the JVM, there are two other major memory consumers, Flink’s net‐ work stack and RocksDB, when it is used as a state backend.
zh_cn: 除了JVM，还有两个组件同样会消耗很多内存——Flink的网络栈和RocksDB（如果选它作为状态后端）。

source: In addition to the WindowAssigner interface there is also the MergingWindowAssigner
zh_cn: 除了WindowAssigner接口外，还有一个继承自它的MergingWindowAssigner接口。

source: In addition to the configuration options in Figures 8-7 and 8-8, a Cassandra sink builder provides a few more methods to configure the sink connector:
zh_cn: 除了示例8-7和8-8中所展示的配置项，Cassandra数据汇构建器还提供了其他一些配置方法：

source: In addition to the generic way of enabling queries on any type of keyed state, Flink also offers shortcuts to define stream sinks that store the events of a stream in a queryable state.
zh_cn: 除了这种将任意类型的键值分区状态设置为可查询式的通用方法外，Flink还提供了一种简便方法，支持利用数据汇将流中所有事件都存到可查询式状态中。

source: In addition to the previously discussed configuration, an HA standalone deployment requires the following configuration changes.
zh_cn: 除了上面讨论的配置外，独立集群模式的HA设置还需要修改以下配置。

source: In addition to the system properties discussed so far, such as failure tolerance, perfor‐ mance, and result accuracy, stream processors also continuously added new opera‐ tional features.
zh_cn: 除了已经讨论过的如：容错、性能、结果精确性等系统属性，流处理引擎还在不断添加新的操作功能。

source: In addition to the system properties discussed so far, such as failure tolerance, perfor‐ mance, and result accuracy, stream processors have also continuously added new operational features such as highly available setups, tight integration with resource managers, such as YARN or Kubernetes, and the ability to dynamically scale stream‐ ing applications.
zh_cn: 除了已经讨论过的容错、性能及结果精确性等系统属性，流处理引擎还在不断添加新的操纵功能（operational feature），例如：高可用设置，和资源管理器（YARN、Kubernetes等）的紧密集成以及支持流式应用动态扩缩容。

source: In addition to these features, Flink is a very developer-friendly framework due to its easy-to-use APIs.
zh_cn: 除了上述特性，Flink还是一个对开发者非常友好的框架，这得益于它十分易用的API。

source: In addition to time-based windows, Flink also supports count- based windows—windows that group a fixed number of elements in the order in which they arrive at the window operator.
zh_cn: Flink除了支持基于时间的窗口，还支持基于数量的窗口。后者会按照元素到达窗口算子的顺序以固定数量对其进行分组。

source: In addition, Flink provides implementations for Apache Avro and text-based JSON encodings.
zh_cn: 除此之外，Flink还为Apache Avro和基于文本的JSON编码提供了相应的实现。

source: In addition, both context objects also provide access to the event-time timestamp, the current watermark, the current processing time, and the side outputs, similar to the context objects of other process functions.
zh_cn: 此外，和其他处理函数的上下文对象类似，此处的两个上下文对象也支持访问状态时间戳、当前水位线、当前处理时间以及副输出。

source: In addition, it is important to ensure that the SourceFunction.run() method, which runs in a separate thread, does not advance the reading offset and emit data while a checkpoint is taken; in other words, while the CheckpointedFunction.snapshot
zh_cn: 此外，我们必须确保由单独线程运行的SourceFunction.run()方法不会在检查点生成过程中（即CheckpointedFunction.snapshotState()调用期间）向前推进偏移和发出数据。

source: In addition, program‐ ming APIs evolved from rather low-level operator interfaces to high-level APIs with more built-in primitives.
zh_cn: 此外，编程API也从低层基于算子的接口进化为拥有更多内置操作原语的高层API。

source: In addition, the Apache Bahir project provides additional Flink connectors for ActiveMQ, Akka, Flume, Netty, and Redis.
zh_cn: 此外，Apache Bahir项目中还额外提供了针对ActiveMQ、Akka、Flume、Influxdb、Kudu、Netty以及Redis的连接器。

source: In addition, the JobManager writes a pointer to the storage location into ZooKeeper’s data store.
zh_cn: 此外，它还会将存储位置的指针写入ZooKeeper的数据存储。

source: In addition, the JobManager writes a pointer to the storage location into ZooKeeper’s datastore.
zh_cn: 此外，JobManager还会将存储位置的路径地址写入ZooKeeper的数据存储。

source: In addition, the RocksDB state backend also features incremental checkpointing, which reduces the amount of data to transfer.
zh_cn: 除此之外，RocksDB状态后端还支持增量生成检查点，这可以降低需要传输的数据量。

source: In addition, the method getRuntimeContext() provides access to the function’s Run timeContext.
zh_cn: 此外，你可以利用getRuntimeContext()方法访问函数的RuntimeContext。

source: In addition, you can use the CLI client to submit detached queries that directly write their results into external storage systems.
zh_cn: 此外，你还可以使用CLI客户端提交分离式查询，让其直接将结果写入外部存储系统。

source: In addition, you need to provide a JSON object with the path to the savepoint folder and a flag telling whether or not to terminate the application with the savepoint.
zh_cn: 此外，你需要提供一个包含了保存点文件夹路径的JSON对象和一个是否在生成保存点后终止应用的标志。

source: In addition, you need to provide the new parallelism of the application as an URL parameter.
zh_cn: 此外，你还需要以URL参数的形式提供一个新的应用并行度。

source: In all of these cases, Flink requires Hadoop dependencies on its classpath.
zh_cn: 无论集成什么你都需要将Hadoop依赖加入Flink的Classpath中。

source: In any case, there is a service running that accepts the Flink application and ensures it is executed.
zh_cn: 无论哪种情况，运行的服务都会接收Flink应用并确保其执行。

source: In batch processing you first need to gather the events in batches and only then you are able to process them.
zh_cn: 在批处理中，你先要批量收集事件，然后才能处理它们。

source: In batch processing, you first need to gather the events in batches and only then can you pro‐ cess them.
zh_cn: 在批处理中，你先要批量收集事件，然后才能处理它们。

source: In batch processing- dominated environments, data streams are also often ingested by monitoring a file‐ system directory and reading files as they appear.
zh_cn: 在以批处理为主的环境中，我们还经常通过监视文件系统目录并读取其中新加文件的方式来读取数据流。

source: In big data architectures they often serve as data source and data sink for batch pro‐ cessing applications.
zh_cn: 在大数据架构中，它常被用作批处理应用的数据源和数据汇。

source: In both cases, Flink links the newly registered state handle object to the existing state.
zh_cn: 无论原因如何，Flink都会将新注册的状态句柄对象和已有状态建立关联。

source: In bulk encoding, records are collected and written in batches.
zh_cn: 而在批量编码模式下，记录会被攒成批，然后一次性写入。

source: In case of a failure, Flink recovers a stateful streaming application by restoring its state from a previous checkpoint and resetting the read position on the event log.
zh_cn: 一旦出现故障，Flink会利用之前的检查点恢复状态并重置事件日志的读取位置，以此来使状态化流处理应用恢复正常。

source: In case of a failure, Flink restores a stateful streaming application by recovering its state from a previously taken checkpoint and resets the read position on the event log.The application will replay (and fast forward) the input events from the event log until it reaches the tail of the stream.
zh_cn: 一旦计算失败，Flink会利用之前的checkpoint恢复状态和重置事件日志的读取指针，以此来使状态化流处理应用恢复正常。随后应用会从事件日志中读取并（快速）重放输入事件，直到数据流末尾。

source: In case of a failure, Flink uses the latest check‐ point to consistently restore the application’s state and restarts the processing.
zh_cn: 一旦发生故障，Flink会利用最新的检查点将应用状态恢复到一个一致性的点并重启处理进程。

source: In case of a failure, a new JobManager looks up the pointer from ZooKeeper and loads the metadata from the persistent storage.
zh_cn: 一旦发生故障，新的JobManager就可以从ZooKeeper中查找相关路径并根据它从持久化存储中加载元数据。

source: In case of a failure, the state of the application is restored from the latest completed checkpoint and processing continues.
zh_cn: 一旦发生故障，应用会从最近一次完成的检查点中恢复状态并继续处理数据。

source: In case of a fail‐ ure, these records will be processed again, which means the checkpoint provides at- least-once instead of exactly-once consistency guarantees.
zh_cn: 一旦出现故障，这些记录会被重复处理，而这意味着检查点只能提供至少一次而非精确一次的一致性保障。

source: In case of a shuffle
zh_cn: 在shuffle或broadcast连接的情况下，每个发送任务都需要针对每个接收任务提供一个缓冲区，因此所需的缓冲区数量是相关算子并发度的平方。

source: In case of a shuffle connection pattern, each sender task needs to be able to send data to each receiving task.
zh_cn: 在shuffle连接模式下，每个发送端的任务都需要能够向每个接受任务发送数据。

source: In case of any problem, they fall back to the remote storage.
zh_cn: 如果出现任何问题，则会回到使用远程存储进行处理。

source: In certain situations you might want to ensure that checkpoints are taken in the con‐ figured checkpointing interval even though a checkpoint takes longer than the inter‐ val.
zh_cn: 在某些情况下，你可能希望即使检查点的生成时间长于间隔，也要保证检查点严格按照配置的间隔生成。

source: In combination with advanced file formats, such as Apache Par‐ quet or Apache ORC, filesystems can efficiently serve analytical query engines such as Apache Hive, Apache Impala, or Presto.
zh_cn: 结合一些高级的文件格式（如Apache Parquet或Apache ORC），文件系统可以有效地服务于很多分析查询引擎（如Apache Hive、Apache Impala或Presto）。

source: In combination with exactly-once checkpointing, resettable sources, and deterministic application logic, upsert writes yield eventually exactly-once output consistency.
zh_cn: 结合精确一次的检查点、可重置的数据源以及确定的应用逻辑，Upsert写操作可以保证输出结果满足最终一致性。

source: In combination with exactly-once failure semantics, systems of this generation are the first open source stream processors capable of computing consistent and accurate results.
zh_cn: 结合精确一次故障恢复语义，这一代系统才称得上第一批能够计算精确一致结果的开源流处理引擎。

source: In combination with exactly-once failure semantics, systems of this generation are the first open source stream processors that are capable of computing consistent and accurate results.
zh_cn: 结合精确一次故障恢复语义，这一代系统才称得上第一批能够计算精确、一致结果的开源流处理引擎。

source: In contrast to SQL INSERT statements, CQL INSERT statements behave like upsert queries—they override existing rows with the same primary key.
zh_cn: 和SQL INSERT不同，CQL INSERT语句的行为类似于Upsert查询，它们会覆盖主键相同的已有行。

source: In contrast to WAL sinks, 2PC sinks can achieve exactly-once output depending on the sink system and the sink’s implementa‐ tion.
zh_cn: 和WAL数据汇不同，2PC数据汇可依赖数据汇系统和数据汇的实现来完成精确一次的结果输出。

source: In contrast to batch processors that guarantee accurate results, the first open source stream processors traded result accuracy for much better latency.
zh_cn: 和提供精确结果的批处理引擎相比，第一代开源流处理引擎通过牺牲结果的准确度换取更低的延迟。

source: In contrast to executing a Flink program by sending it to a remote JobManager, the program is executed in a single JVM. Therefore, certain issues, such as class‐ loading issues, cannot be properly debugged.
zh_cn: 与把Flink程序发送到远程JobManager执行相比，将程序放在单个JVM进程中执行可能会导致某些问题（例如类加载）无法正确调试。

source: In contrast to the AssignerWithPeriodicWatermarks function, this function can—but does not need to—extract a watermark from each record.
zh_cn: 和AssignerWithPeriodicWatermarks函数不同，这个函数不会强制你从每条记录中都提取一个时间戳（虽然这样也行）。

source: In contrast to the JDBC query Future, the onComplete() callback is processed by DirectExecutor because passing the result
zh_cn: 和JDBC查询使用Future不同，onComplete()回调是通过DirectExecutor来处理的，

source: In contrast to the ReduceFunction, the intermediate data type and the output type do not depend on the input type.
zh_cn: 它和ReduceFunction不同的是中间数据类型以及结果类型不再依赖输入类型。

source: In contrast to their Scala counterparts, Flink’s Java tuples are mutable, so the val‐ ues of fields can be reassigned.
zh_cn: 和Scala不同的是，Java元组是可变的，因此可以为其字段重新赋值。

source: In contrast, a stream consumed from a socket cannot be reset because sockets discard data once it has been consumed.
zh_cn: 相反，如果数据流是从套接字（socket）消费而来则无法重置，因为套接字会在数据被取走后将它们丢弃。

source: In contrast, a stream processor that runs a stateful streaming application takes care of all processing steps, including event ingestion, continuous computation including state maintenance, and updating the result.
zh_cn: 相较之下，运行状态化流处理应用的流处理引擎会负责事件获取、维护状态的持续计算、更新结果等所有处理步骤。

source: In contrast, a stream pro‐ cessor that runs a stateful streaming application takes care of all these processing steps, including event ingestion, continuous computation including state mainte‐ nance, and updating the results.
zh_cn: 相比之下，运行状态化流处理应用的流处理引擎会全面负责事件获取、维护状态的持续计算以及更新结果等所有处理步骤。

source: In contrast, event-time semantics yield reproducible and consis‐ tent results which is a hard requirement for many stream processing use cases.
zh_cn: 而事件时间语义恰恰相反，它会生成可重现、一致性的结果，这也是很多流处理场景中的刚性需求。

source: In contrast, event-time semantics yield reprodu‐ cible and consistent results, which is a hard requirement for many stream processing use cases.
zh_cn: 相反，事件时间语义会生成可重现且一致性的结果，这也是很多流处理用例的刚性需求。

source: In contrast, in continuously running streaming jobs, state is durable across events and we can expose it as a first-class citi‐ zen in the programming model.
zh_cn: 反之，在持续运行的流式作业中，每次处理事件所用到的状态都是持久化的，我们完全可以将其作为编程模型中的一等公民。

source: In contrast, savepoints must be manually triggered by a user or an external service and are never automati‐ cally removed by Flink.
zh_cn: 而保存点则与之相反，它们需要由用户或外部服务手动触发，且永远不会被Flink自动删除。

source: In contrast, the 2PC sink requires a sink system that offers transactional support or exposes building blocks to emulate transactions.
zh_cn: 相反，2PC数据汇需要数据汇系统支持事务或提供可用来模拟事务的构件。

source: In contrast, traditional batch processing latencies typically range from a few minutes to several hours.
zh_cn: 相反，传统批处理的延迟可能从几分钟到几小时不等。

source: In con‐ trast to batch processors, the first open source stream processors traded result accu‐ racy for better latency.
zh_cn: 和批处理引擎相比，第一代开源流处理引擎通过牺牲结果的准确度来换取低延迟。

source: In data streaming, latency is measured in units of time, such as milliseconds.
zh_cn: 在流处理中，延迟是以时间片（例如毫秒）为单位测量的。

source: In either case, there is a ser‐ vice running that accepts the Flink application and ensures it is executed.
zh_cn: 无论哪种情况，运行的服务都会接收Flink应用并确保其执行。

source: In essence, exactly-once guarantees mean that our application will provide the correct result, as if a failure never happened.
zh_cn: 本质上，精确一次保障意味着应用总会提供正确的结果，就如同故障从未发生过一般。

source: In essence, exactly-once guarantees mean that our application will provide the correct result, as though a failure never happened.
zh_cn: 本质上，精确一次保障意味着应用总会提供正确的结果，就如同故障从未发生过一般。

source: In essence, watermarks pro‐ vide a logical clock which informs the system about the current event time.
zh_cn: 本质上，水位线提供了一个逻辑时钟，通知系统当前的事件时间。

source: In essence, watermarks provide a logical clock that informs the system about the current event time.
zh_cn: 本质上，水位线提供了一个逻辑时钟，用来通知系统当前的事件时间。

source: In fact, if you want to compute anything interesting in a streaming application, even a simple count, you need to maintain state.
zh_cn: 实际上，如果你想在流式应用中计算任何有意义的结果（即便是简单的计数），都需要维护状态。

source: In fact, it is difficult to find
zh_cn: 事实上，很难从现实世界找到那种瞬间就生成完整数据集的例子。

source: In fact, it is difficult to find examples of finite, complete datasets that are generated all at once.
zh_cn: 事实上，现实世界中很难找到那种瞬间就生成完整数据集的例子。

source: In fact, most nontrivial operations need to memorize records or par‐ tial results because data is streamed and arrives over time.1 Many of Flink’s built-in DataStream operators, sources, and sinks are stateful and buffer records or maintain partial results or metadata.
zh_cn: 事实上，由于数据会随时间以流式到来，但凡稍复杂点的操作大部分都需要对数据本身或中间结果进行记录。1 很多Flink内置的DataStream算子、数据源以及数据汇都是状态化的，它们需要对数据记录进行缓冲或者对中间结果及元数据加以维护。

source: In fact, that is what you achieve by exploiting parallelism in a stream processing pipeline.
zh_cn: 事实上这就是在流处理管道中利用并行性实现的效果。

source: In fact, that’s what happens when you exploit parallelism in a stream processing pipeline.
zh_cn: 事实上这就是在流处理管道中利用并行性实现的效果。

source: In fact, the flatMap transformation is a gener‐ alization of filter and map and can be used to implement both those operations.
zh_cn: 事实上，flatMap转换可以看做是filter和map的泛化，它能够实现后两者的操作。

source: In fact, this has been a common implementation choice before the rise of modern stream processors.
zh_cn: 事实上，在现代流处理引擎兴起之前，状态就是一个常见的实现选择。

source: In fact, you would like your stream processor to not only continue processing in the case of task failures, but also provide correctness guarantees about the result and operator state.
zh_cn: 事实上，你不仅需要流处理引擎在出现任务故障时可以继续运行，还需要它能保证结果和算子状态的正确性。

source: In fact, you would like your stream processor to not only continue the processing in the case of task failures, but also provide correctness guarantees about the result and operator state.
zh_cn: 事实上，你不仅需要流处理引擎在任务故障时可以继续运行，还需要它保证结果和算子状态的正确性。

source: In general, 2PCs are an expensive approach to ensuring consistency in a distributed system.
zh_cn: 总的来说，2PC对分布式系统的一致性保障而言是一种非常昂贵的方法。

source: In general, all data maintained by a task and used to compute the results of a function belong to the state of the task.
zh_cn: 通常意义上，函数里所有需要任务去维护并用来计算结果的数据都属于任务的状态。

source: In general, it is a good idea to define the parallelism of your operators relative to the default parallelism of the environment.
zh_cn: 一般情况下，最好将算子并行度设置为随环境默认并行度变化的值。

source: In general, using processing time for window operations results in nondeterministic results
zh_cn: 通常情况下，在窗口算子中使用处理时间会导致不确定的结果，

source: In job mode, a Flink cluster is started to run a single job.
zh_cn: 在作业模式下，Flink集群启动后只会运行单个作业。

source: In library mode, the application is bundled into a Docker image that also includes the required Flink binaries.
zh_cn: 在库模式下，绑定的应用和所需的Flink二进制文件会一起放入Docker镜像中。

source: In long-running, streaming jobs, each of these tasks can fail at any time.
zh_cn: 对于长期运行的流式作业而言，每个任务都随时有可能出现故障。

source: In many cases, a function does not know if a record will be the last one for a key.
zh_cn: 很多情况下，函数不会知道某条记录是否是该键值所对应的最后一条。

source: In many real-world applications, the system does not have enough knowledge to per‐ fectly determine watermarks.
zh_cn: 在很多现实应用中，系统必须知道足够多的信息才能完美地设置水位线。
